app/controllers/cart_controller.rb

  def index
    @allwares = Ware.all
    @tuser=session[:tuser]
    if @tuser!=nil then
      @ware_shop= session[:ware_shopping]
      @total=0
    end

    if @ware_shop!=nil then
      @ware_shop.each do |key,value|
        @total += @allwares.find_by_wname(key).wprice * value
---
SELECT `wares`.* FROM `wares` WHERE `wares`.`wname` = 'TV' LIMIT 1

  def addcart
    #判断用户是否为空
    @tuser=session[:tuser]

    if @tuser!=nil then
      #根据商品ID查询一条信息
      ware=Ware.find(params[:id]).wname
---
SELECT `wares`.* FROM `wares` WHERE `wares`.`id` = 1 LIMIT 1

  def deleteWare
    deleteName = params[:wname]
    puts deleteName
    @tuser=session[:tuser]
    if @tuser!=nil then
      wareName =Ware.find_by_wname(deleteName).wname
---
SELECT `wares`.* FROM `wares` WHERE `wares`.`wname` = '' LIMIT 1