app/controllers/orders_controller.rb

SELECT `orders`.* FROM `orders`
---
  def index
    @orders = Order.all

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
---
  def show
    @order = Order.find(params[:id])

SELECT `wares`.* FROM `wares` WHERE `wares`.`wname` = 'laptop' LIMIT 1
---
  def new
    @allwares = Ware.all
    @order = Order.new
    @tuser=session[:tuser]
    if @tuser!=nil then
      @ware_shop= session[:ware_shopping]
      @total=0
    end
    if @ware_shop!=nil then
      @ware_shop.each do |key,value|
        @total += @allwares.find_by_wname(key).wprice * value

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 3 LIMIT 1  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @allwares = Ware.all
    @order = Order.find(params[:id])

INSERT INTO `orders` (`uname`, `uaddress`, `upost`, `uphone`, `uhomephone`, `price`, `created_at`, `updated_at`) VALUES ('jack', '133', 'no', '123455', '222', 1299, '2020-05-19 01:56:44.051439', '2020-05-19 01:56:44.051439')
---
  def create
    @allwares = Ware.all
    @order = Order.new
    @order.uname = params[:order][:uname]
    @order.uphone = params[:order][:uphone]
    @order.uhomephone = params[:order][:uhomephone]
    @order.uaddress = params[:order][:uaddress]
    @order.upost = params[:order][:upost]
    @order.price = params[:order][:price]
    @order.save

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 10 LIMIT 1
DELETE FROM `orders` WHERE `orders`.`id` = 10
---
  def emptyOrder
    # Order.delete_all
    @order = Order.find(params[:id])
    @order.destroy

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
---
  def destroy
    @order = Order.find(params[:id])

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 5 LIMIT 1
---
    def set_order
      @order = Order.find(params[:id])