app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT `users`.* FROM `users`

  def checkname
    # puts params[:uname]
    names = User.find_by_uname(params[:uname])
---
SELECT `users`.* FROM `users` WHERE `users`.`uname` = '32sgsgs' LIMIT 1

  def login
    uname=params[:user][:name]
    upass=params[:user][:pass]
    session[:tuser] = nil
    user = User.find_by_uname(uname)
---
SELECT `users`.* FROM `users` WHERE `users`.`uname` = 'lizhonggang80@gmail.com' LIMIT 1

  def show
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1  [["id", 3], ["LIMIT", 1]]

  def edit
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`uname`, `upwd`, `umail`, `created_at`, `updated_at`) VALUES ('user4', '123', 'user4@123.com', '2020-05-18 15:43:29.457192', '2020-05-18 15:43:29.457192')

  def destroy
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1

    def set_user
      @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1