app/controllers/wares_controller.rb

  def index
    @wares = Ware.all
---
SELECT `wares`.* FROM `wares`

  def create
    @ware = Ware.new(ware_params)

    respond_to do |format|
      if @ware.save
---
INSERT INTO `wares` (`wname`, `wdesc`, `wtype`, `wfactory`, `wprice`, `wimg`, `created_at`, `updated_at`) VALUES ('TV', 'changhong tv', 'TV', 'changhong', 299, 'images/goodsImage/2.jpg', '2020-05-18 16:23:01.217705', '2020-05-18 16:23:01.217705')

    def set_ware
      @ware = Ware.find(params[:id])
---
SELECT `wares`.* FROM `wares` WHERE `wares`.`id` = 1 LIMIT 1